___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

<h1><p style="text-align: center;">Pandas Lesson, Session - 8</p><h1>

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

# Text and Time Methods

In [2]:
df=sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
df[df.sex.str.isupper()]

Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []

In [4]:
df.sex=df.sex.str.upper()
df.sex

0        MALE
1      FEMALE
2      FEMALE
3      FEMALE
4        MALE
        ...
886      MALE
887    FEMALE
888    FEMALE
889      MALE
890      MALE
Name: sex, Length: 891, dtype: object

In [5]:
df.embark_town =df.embark_town.str.lower()
df.embark_town

0      southampton
1        cherbourg
2      southampton
3      southampton
4      southampton
          ...
886    southampton
887    southampton
888    southampton
889      cherbourg
890     queenstown
Name: embark_town, Length: 891, dtype: object

In [6]:
df.pclass.astype('string').str.isdigit()

0      True
1      True
2      True
3      True
4      True
       ...
886    True
887    True
888    True
889    True
890    True
Name: pclass, Length: 891, dtype: boolean

In [7]:
df.pclass.astype('string').str.isnumeric()

0      True
1      True
2      True
3      True
4      True
       ...
886    True
887    True
888    True
889    True
890    True
Name: pclass, Length: 891, dtype: boolean

In [8]:
df['age'].value_counts(dropna=False)

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
66.00      1
23.50      1
0.42       1
Name: age, Length: 89, dtype: int64

In [9]:
df['age']=df['age'].replace(np.nan,'UNKNOWN')

In [10]:
df.age.value_counts(dropna=False)

UNKNOWN    177
24.0        30
22.0        27
18.0        26
28.0        25
          ...
70.5         1
0.42         1
66.0         1
53.0         1
34.5         1
Name: age, Length: 89, dtype: int64

In [11]:
df[df.sibsp.astype('string').str.contains('1')]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,MALE,22,1,0,7.2500,S,Third,man,True,NaN,southampton,no,False
1,1,1,FEMALE,38,1,0,71.2833,C,First,woman,False,C,cherbourg,yes,False
3,1,1,FEMALE,35,1,0,53.1000,S,First,woman,False,C,southampton,yes,False
9,1,2,FEMALE,14,1,0,30.0708,C,Second,child,False,NaN,cherbourg,yes,False
10,1,3,FEMALE,4,1,1,16.7000,S,Third,child,False,G,southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
866,1,2,FEMALE,27,1,0,13.8583,C,Second,woman,False,NaN,cherbourg,yes,False
869,1,3,MALE,4,1,1,11.1333,S,Third,child,False,NaN,southampton,yes,False
871,1,1,FEMALE,47,1,1,52.5542,S,First,woman,False,D,southampton,yes,False
874,1,2,FEMALE,28,1,0,24.0000,C,Second,woman,False,NaN,cherbourg,yes,False
888,0,3,FEMALE,UNKNOWN,1,2,23.4500,S,Third,woman,False,NaN,southampton,no,False

In [12]:
df.embark_town.str.find('southampton')

0      0.0
1     -1.0
2      0.0
3      0.0
4      0.0
      ...
886    0.0
887    0.0
888    0.0
889   -1.0
890   -1.0
Name: embark_town, Length: 891, dtype: float64

In [13]:
df.embark_town.str.findall('southampton')

0      [southampton]
1                 []
2      [southampton]
3      [southampton]
4      [southampton]
           ...
886    [southampton]
887    [southampton]
888    [southampton]
889               []
890               []
Name: embark_town, Length: 891, dtype: object

# DateTime

In [14]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [15]:
df=sns.load_dataset('flights')
df

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        144 non-null    int64
 1   month       144 non-null    category
 2   passengers  144 non-null    int64
dtypes: category(1), int64(2)
memory usage: 2.9 KB

In [17]:
df['year']=pd.to_datetime(df['year'])
df.year

0     1970-01-01 00:00:00.000001949
1     1970-01-01 00:00:00.000001949
2     1970-01-01 00:00:00.000001949
3     1970-01-01 00:00:00.000001949
4     1970-01-01 00:00:00.000001949
                   ...
139   1970-01-01 00:00:00.000001960
140   1970-01-01 00:00:00.000001960
141   1970-01-01 00:00:00.000001960
142   1970-01-01 00:00:00.000001960
143   1970-01-01 00:00:00.000001960
Name: year, Length: 144, dtype: datetime64[ns]

In [18]:
from datetime import datetime

In [19]:
df.year.dt.year

0      1970
1      1970
2      1970
3      1970
4      1970
       ...
139    1970
140    1970
141    1970
142    1970
143    1970
Name: year, Length: 144, dtype: int64

In [20]:
df.year.dt.month

0      1
1      1
2      1
3      1
4      1
      ..
139    1
140    1
141    1
142    1
143    1
Name: year, Length: 144, dtype: int64

In [21]:
df.year.dt.day

0      1
1      1
2      1
3      1
4      1
      ..
139    1
140    1
141    1
142    1
143    1
Name: year, Length: 144, dtype: int64

In [22]:
current_date=datetime.now()
current_date

datetime.datetime(2021, 10, 8, 4, 18, 14, 413122)

In [23]:
current_date.date()

datetime.date(2021, 10, 8)

In [24]:
current_date.now()

datetime.datetime(2021, 10, 8, 4, 18, 14, 803123)

In [25]:
current_date.today()

datetime.datetime(2021, 10, 8, 4, 18, 15, 10938)

In [26]:
current_date.month

10

In [27]:
current_date.year

2021

In [28]:
current_date.day

8

In [29]:
date=current_date.strftime(('%d'+' '+'%B'+' '+'%Y'))
date

'08 October 2021'

In [30]:
datetime.strptime(date, '%d %B %Y')

datetime.datetime(2021, 10, 8, 0, 0)

In [31]:
from datetime import timedelta

In [32]:
two_days_before=current_date.now()-timedelta(days=2)
two_days_before

datetime.datetime(2021, 10, 6, 4, 18, 16, 468897)

In [33]:
two_weeks_later=current_date.now()+timedelta(weeks=2)
two_weeks_later

datetime.datetime(2021, 10, 22, 4, 18, 16, 685539)

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [34]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

In [36]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [37]:
import csv
reader = csv.DictReader(open('example.csv'))

In [38]:
df3=pd.DataFrame()
for row in reader:
    df3=df3.append(row,ignore_index=True)
df3

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [39]:
pd.read_csv("titanic_train.csv")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [40]:
?pd.read_csv

In [41]:
pd.read_csv("titanic_train.csv", sep = "\t")

    PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0    1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/...
1    2,1,1,"Cumings, Mrs. John Bradley (Florence Br...
2    3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,S...
3    4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May ...
4    5,0,3,"Allen, Mr. William Henry",male,35,0,0,3...
..                                                 ...
886  887,0,2,"Montvila, Rev. Juozas",male,27,0,0,21...
887  888,1,1,"Graham, Miss. Margaret Edith",female,...
888  889,0,3,"Johnston, Miss. Catherine Helen ""Car...
889  890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,11...
890  891,0,3,"Dooley, Mr. Patrick",male,32,0,0,3703...

[891 rows x 1 columns]

In [45]:
# we can also use exact file path in the parentheses 
pd.read_csv("ornekcsv.csv",sep=';',index_col=0)

       b     c
a
78    12   1.0
78    12   2.0
78   324   3.0
7      2   4.0
88    23   5.0
6      2   NaN
56    11   6.0
7     12   7.0
56    21   7.0
346    2   8.0
5      1   8.0
456   21   8.0
3     12  88.0

In [46]:
pd.read_csv("ornekcsv.csv", sep = ";",usecols=['a','b'],nrows=10)

     a    b
0   78   12
1   78   12
2   78  324
3    7    2
4   88   23
5    6    2
6   56   11
7    7   12
8   56   21
9  346    2

### CSV Output

In [47]:
df.to_csv('example', index=False)

In [49]:
df.to_csv('./example.csv', index=False)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [50]:
# default sheet_name is 0. It means the first sheet comes into.
df = pd.read_excel('Excel_Sample.xlsx')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [51]:
df1 = pd.read_excel('Excel_Sample.xlsx', sheet_name = "Sheet2")
df1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [52]:
df1 = pd.read_excel('Excel_Sample.xlsx', sheet_name = None)
df1

{'Sheet2':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [53]:
type(df1)

dict

In [54]:
 
pd.ExcelFile('Excel_Sample.xlsx').sheet_names

['Sheet2']

### Excel Output

In [55]:
df.to_excel('Excel_Sample1.xlsx', sheet_name='Sheet1', index = False)

In [56]:
df.to_excel("Excel_Sample2.xlsx", sheet_name = "Sheet2", index = False)

In [58]:
df.to_excel("./Excel_Sample2.xlsx", sheet_name = "Sheet2", index = True)

In [60]:
with pd.ExcelWriter('combined_dfs.xlsx') as writer:
    df.to_excel(writer, sheet_name='sample1', index=False)
    df.to_excel(writer, sheet_name='sample2',index=True)

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [61]:
pip install lxml

Requirement already satisfied: lxml in c:\users\igdem\anaconda3\lib\site-packages (4.6.1)
Note: you may need to restart the kernel to use updated packages.

In [62]:
pip install html5lib

Requirement already satisfied: html5lib in c:\users\igdem\anaconda3\lib\site-packages (1.1)
Requirement already satisfied: webencodings in c:\users\igdem\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\igdem\anaconda3\lib\site-packages (from html5lib) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
pip install BeautifulSoup4

Requirement already satisfied: BeautifulSoup4 in c:\users\igdem\anaconda3\lib\site-packages (4.9.3)
Requirement already satisfied: soupsieve>1.2; python_version >= "3.0" in c:\users\igdem\anaconda3\lib\site-packages (from BeautifulSoup4) (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [1]:
df = pd.read_html('https://testsite2.saglik.gov.tr/covid19/EN-69532/general-coronavirus-table.html')
df2 = pd.read_html('https://www.bbc.com/news/world-51235105')

In [2]:
df

[Empty DataFrame
 Columns: [Date, Total Number of Tests, Total Number of Patiens, Total Number of Deaths, Pneumonia Rate in Patients (%), The Number of Seriously Ill Patients, Total Number of Recovered Patients, Number of Cases Today, Number of Patients for Today, Number of Tests for Today, Number of Deaths for Today, Number of Recovered Patients for Today]
 Index: []]

In [3]:
df2

[              Country  Deaths  Death rate*  Total Cases  \
 0                  US  697736        213.3     43479167
 1              Brazil  597948        285.5     21468121
 2               India  448997         33.2     33834702
 3              Mexico  278806        220.9      3681925
 4              Russia  206179        141.5      7474850
 ..                ...     ...          ...          ...
 213             Palau       0          0.0            5
 214  Marshall Islands       0          0.0            4
 215             Samoa       0          0.0            3
 216          Kiribati       0          0.0            2
 217        Micronesia       0          0.0            1

      New Cases  0  10  100  1k  10k  **  Unnamed: 5
 0                                   NaN         NaN
 1                                   NaN         NaN
 2                                   NaN         NaN
 3                                   NaN         NaN
 4                                   NaN         NaN
 ..                                  ...         ...
 213                                 NaN         NaN
 214                                 NaN         NaN
 215                                 NaN         NaN
 216                                 NaN         NaN
 217                                 NaN         NaN

 [218 rows x 6 columns],
                                          Location  Doses per 100 people  \
 0                                           World                  80.4
 1                                           China                 153.0
 2                                           India                  65.0
 3                                              US                 117.7
 4                                          Brazil                 111.0
 ..                                            ...                   ...
 210                                       Burundi                   0.0
 211                                       Eritrea                   0.0
 212                                   North Korea                   0.0
 213  South Georgia and the South Sandwich Islands                   0.0
 214                                       Vatican                   0.0

      Total doses
 0     6330047472
 1     2222373360
 2      906155473
 3      395934825
 4      237425768
 ..           ...
 210            0
 211            0
 212            0
 213            0
 214            0

 [215 rows x 3 columns]]

In [4]:
df2[0].columns

Index(['Country', 'Deaths', 'Death rate*', 'Total Cases',
       'New Cases  0  10  100  1k  10k  **', 'Unnamed: 5'],
      dtype='object')

In [5]:
df3=pd.read_html('https://www.imdb.com/chart/top/')

In [6]:
df3[0]

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. The Shawshank Redemption (1994),9.2,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. The Godfather (1972),9.1,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. The Godfather: Part II (1974),9.0,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. The Dark Knight (2008),9.0,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. 12 Angry Men (1957),8.9,12345678910 NOT YET RELEASED Seen,NaN
...,...,...,...,...,...
245,NaN,246. The Princess Bride (1987),8.0,12345678910 NOT YET RELEASED Seen,NaN
246,NaN,"247. Paris, Texas (1984)",8.0,12345678910 NOT YET RELEASED Seen,NaN
247,NaN,248. Le notti di Cabiria (1957),8.0,12345678910 NOT YET RELEASED Seen,NaN
248,NaN,249. Du rififi chez les hommes (1955),8.0,12345678910 NOT YET RELEASED Seen,NaN
249,NaN,250. Bhaag Milkha Bhaag (2013),8.0,12345678910 NOT YET RELEASED Seen,NaN

In [7]:
df2[0].to_html('simple.html',index=False)

# SQL Connections

In [8]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\igdem\anaconda3\lib\site-packages (1.3.20)
Note: you may need to restart the kernel to use updated packages.

In [1]:
from sqlalchemy import create_engine

In [2]:
temp_db = create_engine('sqlite:///:memory:')

In [3]:
tables = pd.read_html('https://en.wikipedia.org/wiki/World_population')

In [4]:
pop = tables[6]

In [5]:
pop

,Rank,Country,Population,Area(km2),Density(pop/km2),Population trend
0,1,India,1382800000,3287240,421,Growing
1,2,Pakistan,225230000,803940,280,Rapidly growing
2,3,Bangladesh,171480000,143998,1191,Rapidly growing
3,4,Japan,126010000,377873,333,Declining[98]
4,5,Philippines,110920000,300000,370,Growing
5,6,Vietnam,96209000,331689,290,Growing
6,7,United Kingdom,66436000,243610,273,Growing
7,8,South Korea,51781000,99538,520,Steady
8,9,Taiwan,23604000,36193,652,Steady
9,10,Sri Lanka,21803000,65610,332,Growing

In [6]:
pop.to_sql(name='populations',con=temp_db)

In [7]:
pd.read_sql(sql='populations',con=temp_db)

,index,Rank,Country,Population,Area(km2),Density(pop/km2),Population trend
0,0,1,India,1382800000,3287240,421,Growing
1,1,2,Pakistan,225230000,803940,280,Rapidly growing
2,2,3,Bangladesh,171480000,143998,1191,Rapidly growing
3,3,4,Japan,126010000,377873,333,Declining[98]
4,4,5,Philippines,110920000,300000,370,Growing
5,5,6,Vietnam,96209000,331689,290,Growing
6,6,7,United Kingdom,66436000,243610,273,Growing
7,7,8,South Korea,51781000,99538,520,Steady
8,8,9,Taiwan,23604000,36193,652,Steady
9,9,10,Sri Lanka,21803000,65610,332,Growing

In [8]:
pd.read_sql_query(sql="SELECT Country FROM populations",con=temp_db)

          Country
0           India
1        Pakistan
2      Bangladesh
3           Japan
4     Philippines
5         Vietnam
6  United Kingdom
7     South Korea
8          Taiwan
9       Sri Lanka

In [9]:
import sqlite3

In [10]:
df = pd.read_excel('Excel_Sample.xlsx')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
with sqlite3.connect('sample_data.db') as cnnt:
    df.to_sql('sample2',cnnt)

In [12]:
sample_query='SELECT a,b FROM sample2'

In [15]:
with sqlite3.connect('sample_data.db') as cnnt:
    df_out=pd.read_sql_query(sample_query,cnnt)

In [16]:
df_out

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

# End of The Session